[
	{
		"slug": "suraj-sathe",
		"firstName": "Suraj",
		"lastName": "Sathe",
		"position": "Director",
		"email": "",
		"photo": "/team-assets/Suraj.jpg",
		"bio": "Suraj’s journey into the disability and aged care sector began in 2022, when what seemed like a chance step quickly revealed itself as a passion and natural calling. With a background in engineering and a Master of Engineering Science from the University of Adelaide, he brings a rare combination of analytical precision and people-centered leadership to his role.\n\nAs Director of Mighty Orchid Services, Suraj leads the organisation’s governance and strategic direction, ensuring services are both scalable and deeply responsive to community needs in regional Western Australia. His expertise in establishing and expanding care operations, navigating sector regulations, and fostering culturally appropriate engagement has positioned him as a forward-thinking leader dedicated to meaningful impact.\n\nGuided by the Mighty Orchid Services ethos of “People looking after people”, Suraj is committed to building services that reflect compassion, inclusion, and excellence at every level."
	},
	{
		"slug": "prasadani-fernando",
		"firstName": "Prasadani",
		"lastName": "Fernando",
		"position": "Disability Care Manager",
		"email": "",
		"photo": "/team-assets/Pras.jpg",
		"bio": "With over 14 years of experience in the disability sector, including 7 years in management, Pras brings strong expertise in disability services, aged care, risk management, quality assurance, and safeguarding. She holds a Bachelor of Arts, a Diploma in Education, and a Certificate IV in Disability and Aged Care, supporting her ability to lead with knowledge, empathy, and integrity.\n\nShe has successfully guided teams through sector changes, helped countless individuals navigate the NDIS, and championed person-centered approaches that promote independence and better outcomes. She is deeply committed to equity, inclusion, reconciliation, and culturally safe practices.\n\nGuided by the Mighty Orchid Services motto, “People Looking After People”, Pras strives to deliver meaningful, compassionate support especially for those in remote or underserved communities. Her leadership is grounded in compassion, accountability, and continuous improvement, always aiming to uphold both the quality and dignity of the services provided."
	},
	{
		"slug": "manasseh-tirop",
		"firstName": "Manasseh",
		"lastName": "Tirop",
		"position": "Disability Service Officer",
		"email": "",
		"photo": "/team-assets/Manasseh.jpg",
		"bio": "Manasseh brings over three years of experience in disability services, aged care, and community support, grounded in both strategic leadership and compassionate, hands-on care. He holds a Master of Business Administration (MBA), Certificate IV in Disability, and Certificate III in Aged Care, qualifications that reflect his ability to navigate both operational and frontline responsibilities with confidence and insight.\n\nOriginally from Kenya, Manasseh’s upbringing instilled in him a deep appreciation for community, resilience, and empathy, values that continue to shape how he leads and cares within Australia’s support sector.\n\nThroughout his career, he has worked as a Support Worker, Team Leader, and Care Coordinator. In each role, he has remained committed to empowering individuals, fostering inclusive environments, and ensuring participants feel genuinely heard and supported. He leads with integrity and cultural sensitivity, always striving to create spaces where people feel safe, respected, and valued.\n\nHe is passionate about making a meaningful difference in people’s lives. He believes in treating every participant with dignity and empathy and is driven by values of collaboration, respect, and authenticity. His goal is to help individuals thrive and feel a true sense of belonging."
	},
	{
		"slug": "piyumi-balasooriya",
		"firstName": "Piyumi",
		"lastName": "Balasooriya",
		"position": "Care Coordinator",
		"email": "",
		"photo": "/team-assets/Piyumi.jpg",
		"bio": "Piyumi holds a Master of Business Administration (MBA) and a Diploma in Community Services, providing her with a strong foundation in both management and sector-specific expertise. Originally from Sri Lanka, she has spent the past six years in Australia, dedicating herself to making a meaningful impact in the community services sector, guided by the unwavering support of her husband.\n\nShe is currently working as a Care Coordinator at Mighty Orchid Services, where she has gained two years of experience in participant support, staff coordination, and care planning. Prior to this role, she worked as a Support Worker for one year, which gave her valuable frontline experience in understanding the diverse needs of participants.\n\nPiyumi is passionate about helping others, empowering individuals to achieve their goals, and fostering positive community connections. Her strengths include strong listening skills, empathy, and dedication, ensuring that participants and colleagues feel supported and valued.\n\nAt Mighty Orchid Services, Piyumi applies her skills and passion to deliver high-quality, person-centered care, contributing to the organisation’s mission of “People looking after people.”"
	},
	{
		"slug": "nivedita-harikrishnan",
		"firstName": "Nivedita",
		"lastName": "Harikrishnan",
		"position": "HR Advisor",
		"email": "",
		"photo": "/team-assets/Nivedita.jpg",
		"bio": "Nivedita Harikrishnan is a dynamic HR professional with over 3.5 years of experience in strategic HR management, people consulting, and organizational transformation. She has successfully partnered with leading global firms, including Ernst & Young (EY) and Accenture, where she delivered impactful projects in post-merger integration, HRMS implementation, organizational restructuring, and international HR operations.\n\nAt Mighty Orchid Services, Nivedita plays a key role in shaping the people strategy by driving initiatives in talent acquisition, employee relations, compliance, training, and workforce development. She is also passionate about promoting diversity, equity, and inclusion to create an empowered and collaborative workplace culture.\n\nHolding a Post Graduate Diploma in Human Resource Management and a Bachelor’s degree in Management Studies (Human Resource specialization), Nivedita combines strong analytical skills with a people-first mindset. Her goal is to build high-performing, inclusive, and growth-oriented teams that contribute to the long-term success of the organization."
	},
	{
		"slug": "priyanka-chaudhari",
		"firstName": "Priyanka",
		"lastName": "Chaudhari",
		"position": "Administrative Services Coordinator",
		"email": "",
		"photo": "/team-assets/Priyanka.jpg",
		"bio": "Priyanka holds a Bachelor of Engineering and brings over four years of professional experience in administration, IT systems, and service coordination. She offers a versatile skill set to the disability services sector, with strong expertise in data management, process improvement, IT support, and client service coordination, ensuring smooth operations and high-quality support for clients.\n\nBorn and raised in India, Priyanka’s upbringing emphasized resilience, diligence, and empathy. Having served as an Administrative Services Coordinator, she has a proven track record of coordinating services, managing administrative processes, and assisting teams effectively.\n\nPriyanka approaches her work with compassion, accuracy, and professionalism. Guided by values of respect, teamwork, and integrity, she focuses on empowering individuals, optimizing administrative processes, and fostering inclusive, supportive communities."
	},
	{
		"slug": "manori-abeysinghe",
		"firstName": "Manori",
		"lastName": "Abeysinghe",
		"position": "Care Coordinator",
		"email": "",
		"photo": "/team-assets/no-pic.webp",
		"bio": "Manori Abeysinghe grew up in Sri Lanka and immigrated to Australia six years ago. With over nine years of experience as a Registered Nurse in operating theatres and four years as a Care Coordinator in disability services, she brings strong expertise in both healthcare and participant support. Manori holds a Bachelor of Honours in Nursing Science and a Certificate IV in Individual Support, which have strengthened her ability to deliver high-quality, person-centred care.\n\nThroughout her career, she has developed skills in care coordination, participant support planning, clinical nursing in high-pressure environments, problem solving, decision making, teamwork, leadership, and advocacy. Manori has successfully coordinated complex support plans tailored to NDIS participants’ goals and has built strong relationships with participants, families, and stakeholders to achieve meaningful and positive outcomes. She has also led and supported multidisciplinary teams to ensure safe, effective, and collaborative care.\n\nManori is passionate about empowering individuals with disabilities to live fulfilling and independent lives. Guided by empathy, respect, and integrity, she is committed to delivering quality care while promoting inclusion and supporting the wider community."
	},
	{
		"slug": "seruwaia-mulo",
		"firstName": "Seruwaia",
		"lastName": "Mulo",
		"position": "Care Coordinator",
		"email": "",
		"photo": "/team-assets/no-pic.webp",
		"bio": "Seruwaia brings 18 years of teaching experience and three years in the disability sector, where she began as a support worker in aged care and disability services. She holds a Certificate III in Aged Care, Certificate III in Disability, and a Diploma in Community Services. As a coordinator, she is passionate about staying connected with clients, matching them with the right support workers, and helping them navigate funding options like the NDIS. She has successfully supported participants through transitions and continues to advocate for their needs.\n\nHer background in education helps her communicate clearly and build trust with both clients and staff. Originally from Fiji, Seruwaia values empathy, respect, and integrity in everything she does. Seeing the positive impact she can make in someone’s life is what drives her every day. Being part of MTOS allows her to live that purpose while contributing to a stronger, more inclusive community."
	}
]
